# Pandas Operations

In [1]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [3]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [4]:
len(df['col2'].unique())

3

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [9]:
df['col1'] > 2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [10]:
df[df['col1'] > 2]

   col1  col2 col3
2     3   666  ghi
3     4   444  xyz

In [12]:
df[(df['col1'] > 2) & (df['col2'] == 444)]

   col1  col2 col3
3     4   444  xyz

In [13]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [14]:
def times2(n):
    return n * 2

In [16]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col1'].apply(lambda x: x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [18]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [19]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [20]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [21]:
df.drop('col1', axis=1) # inplece = True

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

## workong with NAN values:

In [22]:
import numpy as np
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':[np.nan,'def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  NaN
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [23]:
df.dropna() # axis=0 , inplace=True

   col1  col2 col3
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [24]:
df.dropna(axis=1)

   col1  col2
0     1   444
1     2   555
2     3   666
3     4   444

In [25]:
df

   col1  col2 col3
0     1   444  NaN
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
df.fillna('FILLED !!')

   col1  col2       col3
0     1   444  FILLED !!
1     2   555        def
2     3   666        ghi
3     4   444        xyz

In [28]:
df.isnull()

    col1   col2   col3
0  False  False   True
1  False  False  False
2  False  False  False
3  False  False  False

##### تمامی حقوق برای رضا علوی محفوظ است